Tekla Open API Reference for Tekla Structures 2025
BendSurface.CenterLine Property
 Gets the center line of the bend surface (i.e. the line that crosses every circular cross section of the bend at their center point)
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Line CenterLine { get; }
Public ReadOnly Property CenterLine As Line
	Get
Property Value
Type: Line
See Also
Reference
BendSurface Class
Tekla.Structures.Model Namespace